blog-demo/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "description", "published", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sad"], ["description", "dvsdv"], ["published", 0], ["published_at", "2021-10-03 07:44:00"], ["created_at", "2021-10-03 07:44:25.330724"], ["updated_at", "2021-10-03 07:44:25.330724"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test #2"], ["description", "test this once\r\n"], ["updated_at", "2021-10-03 11:06:27.644875"], ["id", 13]]